gdgly/stm32L151_nbiot_tmote_app_workspace/stm32L151_nbiot_tmote_app_spot_ioctrl/Hardware/NET/net_nbiot_app.c
void NET_NBIOT_CoapInfoStructureInit(void)
{
	memset((void*)&CoapInfoStructure.InfoData, 0, sizeof(CoapInfoStructure.InfoData));
	CoapInfoStructure.HeadPacket.DeviceSN					= TCFG_EEPROM_Get_MAC_SN();
	CoapInfoStructure.HeadPacket.DataLen					= 0x00;
	CoapInfoStructure.HeadPacket.ProtocolType				= 0x00;
	CoapInfoStructure.HeadPacket.Reserved1					= 0x00;
	CoapInfoStructure.HeadPacket.ProtocolVersion				= 0x00;
	CoapInfoStructure.HeadPacket.Reserved2					= 0x00;
	CoapInfoStructure.HeadPacket.PacketType					= 0x05;
	CoapInfoStructure.HeadPacket.PacketNumber				= 0x00;
	CoapInfoStructure.MsgPacket.DestSN						= 0x00;
	CoapInfoStructure.MsgPacket.Version					= 0x01;
}

void NET_NBIOT_CoapPrivateStructureInit(void)
{
	memset((void*)&CoapPrivateStructure.PrivateData, 0, sizeof(CoapPrivateStructure.PrivateData));
	CoapPrivateStructure.HeadPacket.DeviceSN				= TCFG_EEPROM_Get_MAC_SN();
	CoapPrivateStructure.HeadPacket.DataLen					= 0x00;
	CoapPrivateStructure.HeadPacket.ProtocolType				= 0x00;
	CoapPrivateStructure.HeadPacket.Reserved1				= 0x00;
	CoapPrivateStructure.HeadPacket.ProtocolVersion			= 0x00;
	CoapPrivateStructure.HeadPacket.Reserved2				= 0x00;
	CoapPrivateStructure.HeadPacket.PacketType				= 0x07;
	CoapPrivateStructure.HeadPacket.PacketNumber				= 0x00;
	CoapPrivateStructure.MsgPacket.DestSN					= 0x00;
	CoapPrivateStructure.MsgPacket.Version					= 0x01;
}

void NET_NBIOT_CoapSentDataAfterExexution(void)
{
	TCFG_Utility_Add_NBIot_SentCount();
	TCFG_Utility_Add_NBIot_SentCountDay();
#if NBCOAP_LISTEN_PARAMETER_TYPE == NBCOAP_LISTEN_PARAMETER_ENABLE
	NbiotClientHandler.ListenRunCtl.ListenEnterParameter.listenEnable = true;
#endif
}
#endif

#if NETPROTOCAL == NETMQTTSN
void NET_NBIOT_MqttSNShortStructureInit(void)
{
	MqttSNShortStructure.HeadPacket.DeviceSN				= TCFG_EEPROM_Get_MAC_SN();
	MqttSNShortStructure.HeadPacket.DataLen					= 0x00;
	MqttSNShortStructure.HeadPacket.ProtocolType				= 0x00;
	MqttSNShortStructure.HeadPacket.Reserved1				= 0x00;
	MqttSNShortStructure.HeadPacket.ProtocolVersion			= 0x00;
	MqttSNShortStructure.HeadPacket.Reserved2				= 0x00;
	MqttSNShortStructure.HeadPacket.PacketType				= 0x05;
	MqttSNShortStructure.HeadPacket.PacketNumber				= 0x00;
	MqttSNShortStructure.MsgPacket.DestSN					= 0x00;
	MqttSNShortStructure.MsgPacket.Version					= 0x01;
}

void NET_NBIOT_MqttSNLongStructureInit(void)
{
	MqttSNLongStructure.HeadPacket.DeviceSN					= TCFG_EEPROM_Get_MAC_SN();
	MqttSNLongStructure.HeadPacket.DataLen					= 0x00;
	MqttSNLongStructure.HeadPacket.ProtocolType				= 0x00;
	MqttSNLongStructure.HeadPacket.Reserved1				= 0x00;
	MqttSNLongStructure.HeadPacket.ProtocolVersion			= 0x00;
	MqttSNLongStructure.HeadPacket.Reserved2				= 0x00;
	MqttSNLongStructure.HeadPacket.PacketType				= 0x05;
	MqttSNLongStructure.HeadPacket.PacketNumber				= 0x00;
	MqttSNLongStructure.MsgPacket.DestSN					= 0x00;
#if MQTTSN_STATUS_MSG_VERSION_TYPE == MQTTSN_STATUS_MSG_VERSION_V1
	MqttSNLongStructure.MsgPacket.Version					= 0x01;
#elif MQTTSN_STATUS_MSG_VERSION_TYPE == MQTTSN_STATUS_MSG_VERSION_V2
	MqttSNLongStructure.MsgPacket.Version					= 0x02;
#endif
}

void NET_NBIOT_MqttSNInfoStructureInit(void)
{
	memset((void*)&MqttSNInfoStructure.InfoData, 0, sizeof(MqttSNInfoStructure.InfoData));
	MqttSNInfoStructure.HeadPacket.DeviceSN					= TCFG_EEPROM_Get_MAC_SN();
	MqttSNInfoStructure.HeadPacket.DataLen					= 0x00;
	MqttSNInfoStructure.HeadPacket.ProtocolType				= 0x00;
	MqttSNInfoStructure.HeadPacket.Reserved1				= 0x00;
	MqttSNInfoStructure.HeadPacket.ProtocolVersion			= 0x00;
	MqttSNInfoStructure.HeadPacket.Reserved2				= 0x00;
	MqttSNInfoStructure.HeadPacket.PacketType				= 0x05;
	MqttSNInfoStructure.HeadPacket.PacketNumber				= 0x00;
	MqttSNInfoStructure.MsgPacket.DestSN					= 0x00;
	MqttSNInfoStructure.MsgPacket.Version					= 0x01;
}

void NET_NBIOT_MqttSNPrivateStructureInit(void)
{
	memset((void*)&MqttSNPrivateStructure.PrivateData, 0, sizeof(MqttSNPrivateStructure.PrivateData));
	MqttSNPrivateStructure.HeadPacket.DeviceSN				= TCFG_EEPROM_Get_MAC_SN();
	MqttSNPrivateStructure.HeadPacket.DataLen				= 0x00;
	MqttSNPrivateStructure.HeadPacket.ProtocolType			= 0x00;
	MqttSNPrivateStructure.HeadPacket.Reserved1				= 0x00;
	MqttSNPrivateStructure.HeadPacket.ProtocolVersion			= 0x00;
	MqttSNPrivateStructure.HeadPacket.Reserved2				= 0x00;
	MqttSNPrivateStructure.HeadPacket.PacketType				= 0x07;
	MqttSNPrivateStructure.HeadPacket.PacketNumber			= 0x00;
	MqttSNPrivateStructure.MsgPacket.DestSN					= 0x00;
	MqttSNPrivateStructure.MsgPacket.Version				= 0x01;
}

void NET_NBIOT_MqttSNSentDataAfterExexution(void)
{
	TCFG_Utility_Add_NBIot_SentCount();
	TCFG_Utility_Add_NBIot_SentCountDay();
#if NBMQTTSN_LISTEN_PARAMETER_TYPE == NBMQTTSN_LISTEN_PARAMETER_ENABLE
	MqttSNClientHandler.ListenRunCtl.ListenEnterParameter.listenEnable = true;
#endif
}
#endif

#if NETPROTOCAL == NETONENET
void NET_NBIOT_OneNETShortStructureInit(void)
{
	OneNETShortStructure.HeadPacket.DeviceSN				= TCFG_EEPROM_Get_MAC_SN();
	OneNETShortStructure.HeadPacket.DataLen					= 0x00;
	OneNETShortStructure.HeadPacket.ProtocolType				= 0x00;
	OneNETShortStructure.HeadPacket.Reserved1				= 0x00;
	OneNETShortStructure.HeadPacket.ProtocolVersion			= 0x00;
	OneNETShortStructure.HeadPacket.Reserved2				= 0x00;
	OneNETShortStructure.HeadPacket.PacketType				= 0x05;
	OneNETShortStructure.HeadPacket.PacketNumber				= 0x00;
	OneNETShortStructure.MsgPacket.DestSN					= 0x00;
	OneNETShortStructure.MsgPacket.Version					= 0x01;
}

void NET_NBIOT_OneNETLongStructureInit(void)
{
	OneNETLongStructure.HeadPacket.DeviceSN					= TCFG_EEPROM_Get_MAC_SN();
	OneNETLongStructure.HeadPacket.DataLen					= 0x00;
	OneNETLongStructure.HeadPacket.ProtocolType				= 0x00;
	OneNETLongStructure.HeadPacket.Reserved1				= 0x00;
	OneNETLongStructure.HeadPacket.ProtocolVersion			= 0x00;
	OneNETLongStructure.HeadPacket.Reserved2				= 0x00;
	OneNETLongStructure.HeadPacket.PacketType				= 0x05;
	OneNETLongStructure.HeadPacket.PacketNumber				= 0x00;
	OneNETLongStructure.MsgPacket.DestSN					= 0x00;
#if ONENET_STATUS_MSG_VERSION_TYPE == ONENET_STATUS_MSG_VERSION_33BYTE_V1
	OneNETLongStructure.MsgPacket.Version					= 0x01;
#elif ONENET_STATUS_MSG_VERSION_TYPE == ONENET_STATUS_MSG_VERSION_77BYTE_V2
	OneNETLongStructure.MsgPacket.Version					= 0x02;
#endif
}

void NET_NBIOT_OneNETInfoStructureInit(void)
{
	memset((void*)&OneNETInfoStructure.InfoData, 0, sizeof(OneNETInfoStructure.InfoData));
	OneNETInfoStructure.HeadPacket.DeviceSN					= TCFG_EEPROM_Get_MAC_SN();
	OneNETInfoStructure.HeadPacket.DataLen					= 0x00;
	OneNETInfoStructure.HeadPacket.ProtocolType				= 0x00;
	OneNETInfoStructure.HeadPacket.Reserved1				= 0x00;
	OneNETInfoStructure.HeadPacket.ProtocolVersion			= 0x00;
	OneNETInfoStructure.HeadPacket.Reserved2				= 0x00;
	OneNETInfoStructure.HeadPacket.PacketType				= 0x05;
	OneNETInfoStructure.HeadPacket.PacketNumber				= 0x00;
	OneNETInfoStructure.MsgPacket.DestSN					= 0x00;
	OneNETInfoStructure.MsgPacket.Version					= 0x01;
}

